package summary

var (
	// aeKey映射
	AEKeyMap = map[string]Risk{
		// 血糖
		"JB0001": {
			Label: "血糖",
		},
		// 血压
		"JB0002": {
			Label: "血压",
		},
		// 血脂
		"JB0003": {
			Label: "血脂",
		},
		// 脊柱
		"JB0005": {
			Label: "脊柱",
		},
		// 焦虑
		"JB0006": {
			Label: "焦虑",
		},
		// 颈椎
		"JB0007": {
			Label: "颈椎",
		},
		// 咽炎
		"JB0008": {
			Label: "咽炎",
		},
		// 脑供血
		"JB0011": {
			Label: "脑供血",
		},
		// 免疫力
		"JB0012": {
			Label: "免疫力",
		},
		// 疲劳
		"JB0013": {
			Label: "疲劳",
		},
		// 肾功能
		"JB0014": {
			Label: "肾功能",
		},
		// 心梗
		"JB0015": {
			Label: "心梗",
		},
		// 抑郁
		"JB0016": {
			Label: "抑郁",
		},
		// 睡眠
		"JB0017": {
			Label: "睡眠",
		},
		// 胃动力
		"JB0018": {
			Label: "胃动力",
		},
		// 胃炎
		"JB0019": {
			Label: "胃炎",
		},
		// 心肾不交
		"Z0001": {
			Label: "心肾不交",
		},
		// 肾阳虚
		"Z0002": {
			Label: "肾阳虚",
		},
		// 肾阴虚
		"Z0003": {
			Label: "肾阴虚",
		},
		// 脾胃不调，胃火偏旺
		"Z0004": {
			Label: "脾胃不调，胃火偏旺",
		},
		// 湿热困脾
		"Z0005": {
			Label: "湿热困脾",
		},
		// 寒湿困脾
		"Z0006": {
			Label: "寒湿困脾",
		},
		// 心血瘀阻
		"Z0007": {
			Label: "心血瘀阻",
		},
		// 肺失宣泄，肺气不足
		"Z0008": {
			Label: "肺失宣泄，肺气不足",
		},
		// 心气不足
		"Z0009": {
			Label: "心气不足",
		},
		// 心火上炎
		"Z0010": {
			Label: "心火上炎",
		},
		// 肝气郁结，肝血亏虚
		"Z0011": {
			Label: "肝气郁结，肝血亏虚",
		},
		// 气血双虚
		"Z0012": {
			Label: "气血双虚",
		},
		// 心血亏虚
		"Z0013": {
			Label: "心血亏虚",
		},
		// 肝火上炎
		"Z0014": {
			Label: "肝火上炎",
		},
		// 肝血亏虚
		"Z0015": {
			Label: "肝血亏虚",
		},
		// 肝气郁结
		"Z0016": {
			Label: "肝气郁结",
		},
		// 胃阴虚
		"Z0017": {
			Label: "胃阴虚",
		},
		// 胃气不足
		"Z0018": {
			Label: "胃气不足",
		},
		// 胆火旺
		"Z0019": {
			Label: "胆火旺",
		},
		// 胆气虚
		"Z0020": {
			Label: "胆气虚",
		},
		// 脾气虚
		"Z0021": {
			Label: "脾气虚",
		},
		// 恭喜您，脏腑功能良好
		"Z0022": {
			Label: "恭喜您，脏腑功能良好",
		},

		// 自定义KEY
		// 血瘀
		"XY": {
			Label: "血瘀",
		},
		// 湿气
		"SQ": {
			Label: "湿气",
		},

		// 阳虚质（脉沉迟）
		"T0001": {
			Label: "阳虚质（脉沉迟）",
		},
		// 阴虚质（脉细数）
		"T0002": {
			Label: "阴虚质（脉细数）",
		},
		// 气虚质（脉弱）
		"T0003": {
			Label: "气虚质（脉弱）",
		},
		// 气郁质（脉弦）
		"T0004": {
			Label: "气郁质（脉弦）",
		},
		// 倾向气郁质（脉弦）
		"T0005": {
			Label: "倾向气郁质（脉弦）",
		},
		// 倾向阴虚质（脉细数）
		"T0006": {
			Label: "倾向阴虚质（脉细数）",
		},
		// 平和倾向阳虚质（脉稍沉迟）
		"T0007": {
			Label: "平和倾向阳虚质（脉稍沉迟）",
		},
		// 接近平和质（脉稍平）
		"T0008": {
			Label: "接近平和质（脉稍平）",
		},
		// 倾向气虚质（脉稍弱）
		"T0009": {
			Label: "倾向气虚质（脉稍弱）",
		},
		// 接近平和质（脉平稍数）
		"T0010": {
			Label: "接近平和质（脉平稍数）",
		},
		// 接近平和质（脉平稍细）
		"T0011": {
			Label: "接近平和质（脉平稍细）",
		},
		// 平和质
		"T0012": {
			Label: "平和质",
		},
		// 痰湿质兼血瘀质（脉弦滑）
		"T0013": {
			Label: "痰湿质兼血瘀质（脉弦滑）",
		},
		// 痰湿质（脉滑）
		"T0014": {
			Label: "痰湿质（脉滑）",
		},
		// 湿热质（脉滑数）
		"T0015": {
			Label: "湿热质（脉滑数）",
		},
		// 血瘀质（脉涩）
		"T0016": {
			Label: "血瘀质（脉涩）",
		},
		// 倾向气郁质（脉稍弦）
		"T0017": {
			Label: "倾向气郁质（脉稍弦）",
		},
		// 倾向阴虚质（脉稍细数）
		"T0018": {
			Label: "倾向阴虚质（脉稍细数）",
		},
		// 倾向阳虚质（脉稍沉迟）
		"T0019": {
			Label: "倾向阳虚质（脉稍沉迟）",
		},
		// 平和倾向阴虚质（脉稍细数）
		"T0020": {
			Label: "平和倾向阴虚质（脉稍细数）",
		},
		// 阴虚质兼血瘀质（脉细数）
		"T0021": {
			Label: "阴虚质兼血瘀质（脉细数）",
		},
		// 阴虚质兼痰湿质（脉细数）
		"T0022": {
			Label: "阴虚质兼痰湿质（脉细数）",
		},
		// 阴虚质兼湿热质（脉细数）
		"T0023": {
			Label: "阴虚质兼湿热质（脉细数）",
		},
		// 阴虚质兼气郁质（脉细数）
		"T0024": {
			Label: "阴虚质兼气郁质（脉细数）",
		},
		// 阳虚质兼气郁质（脉沉涩）
		"T0025": {
			Label: "阳虚质兼气郁质（脉沉涩）",
		},
		// 阳虚质（脉沉）
		"T0026": {
			Label: "阳虚质（脉沉）",
		},
		// 阴虚质（脉细）
		"T0027": {
			Label: "阴虚质（脉细）",
		},
		// 倾向阴虚质（脉稍细）
		"T0028": {
			Label: "倾向阴虚质（脉稍细）",
		},
		// 倾向阳虚质（脉稍沉）
		"T0029": {
			Label: "倾向阳虚质（脉稍沉）",
		},
		// 倾向阴虚质（脉细）
		"T0030": {
			Label: "倾向阴虚质（脉细）",
		},
		// 平和倾向阳虚质（脉稍沉）
		"T0031": {
			Label: "平和倾向阳虚质（脉稍沉）",
		},
		// 平和倾向阴虚质（脉稍细）
		"T0032": {
			Label: "平和倾向阴虚质（脉稍细）",
		},
		// 阴虚质兼血瘀质（脉细）
		"T0033": {
			Label: "阴虚质兼血瘀质（脉细）",
		},
		// 阴虚质兼痰湿质（脉细）
		"T0034": {
			Label: "阴虚质兼痰湿质（脉细）",
		},
		// 阴虚质兼湿热质（脉细）
		"T0035": {
			Label: "阴虚质兼湿热质（脉细）",
		},
		// 阴虚质兼气郁质（脉细）
		"T0036": {
			Label: "阴虚质兼气郁质（脉细）",
		},
		// 湿热质（脉滑）
		"T0037": {
			Label: "湿热质（脉滑）",
		},
	}
	// 风险疾病map
	RiskyDiseaseMap = map[string]Risk{
		// 血糖
		"JB0001": {
			Label: "血糖",
		},
		// 血压
		"JB0002": {
			Label: "血压",
		},
		// 血脂
		"JB0003": {
			Label: "血脂",
		},
		// 脊柱
		"JB0005": {
			Label: "脊柱",
		},
		// 焦虑
		"JB0006": {
			Label: "焦虑",
		},
		// 颈椎
		"JB0007": {
			Label: "颈椎",
		},
		// 咽炎
		"JB0008": {
			Label: "咽炎",
		},
		// 脑供血
		"JB0011": {
			Label: "脑供血",
		},
		// 免疫力
		"JB0012": {
			Label: "免疫力",
		},
		// 疲劳
		"JB0013": {
			Label: "疲劳",
		},
		// 肾功能
		"JB0014": {
			Label: "肾功能",
		},
		// 心梗
		"JB0015": {
			Label: "心梗",
		},
		// 抑郁
		"JB0016": {
			Label: "抑郁",
		},
		// 睡眠
		"JB0017": {
			Label: "睡眠",
		},
		// 胃动力
		"JB0018": {
			Label: "胃动力",
		},
		// 胃炎
		"JB0019": {
			Label: "胃炎",
		},
	}
	// 脏腑辩证map
	DirtyDialecticsMap = map[string]Risk{
		// 心肾不交
		"Z0001": {
			Label: "心肾不交",
		},
		// 肾阳虚
		"Z0002": {
			Label: "肾阳虚",
		},
		// 肾阴虚
		"Z0003": {
			Label: "肾阴虚",
		},
		// 脾胃不调，胃火偏旺
		"Z0004": {
			Label: "脾胃不调，胃火偏旺",
		},
		// 湿热困脾
		"Z0005": {
			Label: "湿热困脾",
		},
		// 寒湿困脾
		"Z0006": {
			Label: "寒湿困脾",
		},
		// 心血瘀阻
		"Z0007": {
			Label: "心血瘀阻",
		},
		// 肺失宣泄，肺气不足
		"Z0008": {
			Label: "肺失宣泄，肺气不足",
		},
		// 心气不足
		"Z0009": {
			Label: "心气不足",
		},
		// 心火上炎
		"Z0010": {
			Label: "心火上炎",
		},
		// 肝气郁结，肝血亏虚
		"Z0011": {
			Label: "肝气郁结，肝血亏虚",
		},
		// 气血双虚
		"Z0012": {
			Label: "气血双虚",
		},
		// 心血亏虚
		"Z0013": {
			Label: "心血亏虚",
		},
		// 肝火上炎
		"Z0014": {
			Label: "肝火上炎",
		},
		// 肝血亏虚
		"Z0015": {
			Label: "肝血亏虚",
		},
		// 肝气郁结
		"Z0016": {
			Label: "肝气郁结",
		},
		// 胃阴虚
		"Z0017": {
			Label: "胃阴虚",
		},
		// 胃气不足
		"Z0018": {
			Label: "胃气不足",
		},
		// 胆火旺
		"Z0019": {
			Label: "胆火旺",
		},
		// 胆气虚
		"Z0020": {
			Label: "胆气虚",
		},
		// 脾气虚
		"Z0021": {
			Label: "脾气虚",
		},
		// 恭喜您，脏腑功能良好
		"Z0022": {
			Label: "恭喜您，脏腑功能良好",
		},
		// 脾阳虚
		"Z0023": {
			Label: "脾阳虚",
		},
	}
	// 理疗map
	PhysicalTherapyMap = map[string]Risk{
		// 自定义KEY
		// 血瘀
		"XY": {
			Label: "血瘀",
		},
		// 湿气
		"SQ": {
			Label: "湿气",
		},
	}
)
