<template>
  <div class="license-container">
    <div class="license-body">
      <div class="license-title">
        <h2>慧脉系统服务协议条款</h2>
      </div>
      <div class="license-content">
        <article>
          <p>
            请务必认真阅读和理解本《用户服务协议》（以下简称《协议》）中规定的所有权利和限制。除非您接受本《协议》条款，否则您无权注册、登录或使用本协议所涉及的相关服务。您一旦注册、登录、使用或以任何方式使用本《协议》所涉及的相关服务的行为将视为对本《协议》的接受，即表示您同意接受本《协议》各项条款的约束。如果您不同意本《协议》中的条款，请不要注册、登录或使用本《协议》相关服务。
            本《协议》是用户与常州金姆健康科技有限公司（以下简称金姆健康公司）之间的法律协议。</p>
          <p>一 、 服 务 内 容</p>
          <p>1.1 ：常州金姆健康科技有限公司为网站的所有者及经营者，完全按照其发布的服务条款和操作规则提供基于互联网以及移动互联网的软件产品（以下简称"软件"），软件的具体内容由金姆健康公司根据实际情况提供。</p>
          <p>1.2
            ：您一旦购买成为用户，您将会有一个密码和帐号，您需要对自己在帐户中的所有活动和事件负全责。金姆健康公司默认账号密码的使用者为用户本人或者其他有权使用者，并在账号密码能登陆并正常使用的情况下即提供服务，不对由此而导致的任何后果负责。如果由于您的过失导致您的帐号和密码脱离您的控制，则由此导致的针对您、或任何第三方造成的损害，您将承担全部责任。
          </p>
          <p>1.3 ：用户知晓并理解，金姆健康公司只是软件和服务提供商，无权对软件的使用 者和所有权人做出判定，亦不介入相关纠纷。用户由于软件归属和使用产生的纠纷由用户自行解决。</p>
          <p>1.4 ：用户理解并接受，金姆健康公司仅提供相关的软件，除此之外与软件有关的
            设备（如个人电脑、手机、及其他与接入互联网或移动互联网有关的装置）及所需的费用（如为接入互联网而支付的电话费及上网费、为使用移动网而支付的手机费）均应由用户自行负担。</p>
          <p>二、用户使用规范：</p>
          <p>
            用户在申请使用金姆健康公司软件或网站时，必须向金姆健康公司提供准确的用户资料，如用户资料有任何变动，必须及时更新。金姆健康公司不对用户提供的资料做实质审核，仅作为业务办理时核对用户信息的依据，因用户提供资料不准确、不真实或者对外披露而引发的一切后果由用户承担。
          </p>
          <p>2.1 ：用户不应将其帐号、密码转让、出借或以任何脱离用户控制的形式交由他 人使用。如用户发现其帐号遭他人非法使用，应立即通知金姆健康公司。非因金姆健康公司过错导致账号被他人非法使用的，金姆健康公司不承担任何责任。
          </p>
          <p>2.2 ：当您的用户名和密码丢失无法自行找回，需要向金姆健康公司申请重置密码或者修改注册信息时，需要提供以下书面资料（或资料存照）：</p>
          <p>1. 书面申请，写明需要申请的业务内容及原因；</p>
          <p>2. 慧脉药系统账号的注册公司名称，公司法定代表人，注册账号时填写的联系人，联系电话等信息；</p>
          <p>3. 营业执照、法定代表人身份证复印件。上述资料均需法定代表人签字，并加盖公司公章（如果账号为个人使用，则需要提供＇注册联系人＇的身份证明材料）
            等信息。金姆健康公司工作人员在核对信息一致后，协助客户完成上述业务办理。金姆健康公司仅对上述资料做形式审查，若因用户上述信息被盗用、对外披露或者被第三方非法使用而导致账号内容及相关资料的修改或者泄露的，金姆健康公司不承担任何责任。
          </p>
          <p>2.3 ：用户应当为自身帐户下的一切行为负责，因用户行为而导致的用户自身或其他任何第三方的任何损失或损害，金姆健康公司不承担责任。</p>
          <p>2.4 ：用户理解并接受金姆健康公司提供的服务中可能包括广告，用户同意在使用过程中显示金姆健康公司和第三方供应商、合作伙伴提供的广告。</p>
          <p>2.5 ：用户在使用金姆健康公司软件或网站过程中，必须遵循以下原则：</p>
          <p>a) 遵守中国有关的法律和法规；</p>
          <p>b) 遵守所有软件有关的网络协议、规定和程序；</p>
          <p>c) 不得为任何非法目的而使用软件；</p>
          <p>d) 不得侵犯金姆健康公司和其他任何第三方的专利权、著作权、商标权、名誉权或其他任何合法权益；</p>
          <p>e) 不得利用金姆健康公司软件进行任何不利于金姆健康公司的行为；</p>
          <p>f) 如发现任何非法使用用户帐号或帐号出现安全漏洞的情况，应立即通告金姆健康公司 。</p>
          <p>2.6 ：如用户在使用金姆健康公司软件时违反任何上述规定，金姆健康公司或其授权
            的人有权要求用户改正或直接采取一切必要的措施（包括但不限于更改或删除用户账号等、暂停或终止用户使用软件服务的权利）以减轻用户不当行为造成的影响。</p>
          <p>三、服务变更、中断或终止</p>
          <p>3.1：鉴于网络服务的特殊性，用户同意金姆健康公司有权根据业务发展情况随时 变更、中断或终止部分或全部的网络服务而无需通知用户，也无需对任何用户或任何第三方承担任何责任。</p>
          <p>3.2 ：用户理解，金姆健康公司需要定期或不定期地对软件进行升级，如因此类情 况而造成网络服务在合理时间内的中断，金姆健康公司无需为此承担任何责任，但金姆健康公司应尽可能事先进行通告。</p>
          <p>3.3 ：如发生下列任何一种情形，金姆健康公司有权随时中断或终止向用户提供本</p>
          <p>《协议》项下的网络服务（包括收费网络服务）而无需对用户或任何第三方承担任何责任：</p>
          <p>a) 用户提供的个人资料不真实；</p>
          <p>b) 用户违反本《协议》中规定的使用规则。</p>
          <p>四、知识产权</p>
          <p>4.1 ：提供的软件中包含的任何文本、图片、图形、音频和/或视频资料均受版 权、商标和/或其它财产所有权法律的保护，未经相关权利人同意，上述资料均不得用于任何商业目的。</p>
          <p>4.2 ：为提供软件和网站而使用的任何软件（包括但不限于软件中所含的任何图象、照
            片、动画、录像、录音、音乐、文字和附加程序、随附的帮助材料）的一切权利均属于该软件的著作权人，未经该软件的著作权人许可，用户不得对该软件进行反向工程（reverse
            engineer）、反向编译（decompile）或反汇编（disassemble）。</p>
          <p>4.3 ：软件和网站的一切权利均属于金姆健康公司，未经金姆健康公司许可，用户不得对软件进行反向工程（reverse engineer）、反向编译（decompile）或反汇编（disassemble）</p>
          <p>五 、 隐 私 保 护</p>
          <p>5.1：保护用户隐私是金姆健康公司的一项基本政策，金姆健康公司保证不对外公开 或向第三方提供单个用户的注册资料及用户在使用软件时存储在金姆健康公司的非公开内容，但下列情况除外：</p>
          <p>a) 事先获得用户的明确授权；</p>
          <p>b) 根据有关的法律法规要求；</p>
          <p>c) 配合相关政府主管部门的要求；</p>
          <p>d) 为维护金姆健康公司的合法权益。</p>
          <p>5.2 ：为了更好地为用户提供服务，金姆健康公司可能会与第三方合作开发相关软 件，在此情况下，如该第三方同意承担与金姆健康公司同等的保护用户隐私的责
            任，则金姆健康公司有权将用户的注册资料等提供给该第三方，该利用仅限于软件开发和服务升级等方面。</p>
          <p>5.3 ：在不透露单个用户隐私资料的前提下，金姆健康公司有权对整个用户数据库进行分析并对用户数据库进行商业上的利用，包括但不限于用户的使用习惯、注册资料统计数据等。</p>
          <p>六 、 免 责 声 明</p>
          <p>6.1：金姆健康公司不担保软件和网站一定能满足用户的要求，也不担保网络服务不会中断，对网络服务的及时性、安全性、准确性也都不作担保。</p>
          <p>6.2 ：对于因电信系统或互联网网络故障、计算机故障或病毒、信息损坏或丢 失、计算机系统问题或其它任何不可抗力原因而产生损失，金姆健康公司不承担任何责任，但将尽力减少因此而给用户造成的损失和影响。</p>
          <p>6.3
            ：使用本软件和网站产品由您自己承担风险，此软件和网站不包含任何使用保证，不能保证使用中不出故障。在适用法律允许的最大范围内，金姆健康公司在任何情况下不就因使用或不能使用本软件产品所发生的特殊的、意外的、直接或间接的损失承担赔偿责任。
            对您因软件遗失、被盗、毁损、误用、或擅自修改造成的损失金姆健康公司不承担任何责任。</p>
          <p>6.4 ：本软件产生的测量报告和数据仅供健康评估参考，不能作为医疗诊断和建议；在做出任何医疗决定之前，请向专业医生寻求诊断与建议；对您因使用软件过程中产生的医疗事故或医疗损害，金姆健康公司不承担任何责任。</p>
          <p>七、法律及争议解决</p>
          <p>7.1 ：本协议适用中华人民共和国法律。</p>
          <p>7.2 ：因本协议引起的或与本协议有关的任何争议，各方应友好协商解决；协商 不成的，任何一方均可将有关争议提交至被告所在地仲裁委员会并按照其届时有效的仲裁规则仲裁；仲裁裁决是终局的，对各方均有约束力。</p>
          <p>八 、 其 他 条 款</p>
          <p>8.1 ：如果本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，或违反任何适用的法律，则该条款被视为删除，但本协议的其余条款仍应有效并且有约束力。</p>
          <p>8.2 ：金姆健康公司有权随时根据有关法律、法规的变化以及公司经营状况和经营
            策略的调整等修改本协议，并以官网公告的形式告知用户。用户可随时通过网站浏览最新服务协议条款。如果不同意金姆健康公司对本协议相关条款所做的修改，
            用户有权停止使用软件和网站。如果用户继续使用软件和网站，则视为用户接受金姆健康公司对本协议相关条款所做的修改。当发生有关争议时，以最新的协议文本为准</p>
          <p>8.3 ：金姆健康公司在法律允许最大范围对本协议拥有解释权与修改权。</p>
        </article>
      </div>
    </div>
  </div>
</template>

<script setup>
</script>

<style lang="scss" scoped>
.license-container {
  background-color: #f6f7f8;
  width: 100%;
  min-height: 100%;
  padding: 125px 0;

  .license-body {
    margin: 0 auto;
    width: 1050px;

    .license-title {
      text-align: center;
      color: #333;
    }

    .license-content::v-deep {
      margin-top: 40px;

      p {
        font-size: 14px;
        color: #333;
        margin-block-start: 0;
        text-indent: 28px;
        text-align: justify;
        line-height: 28px;
      }
    }
  }
}
</style>
